# [pandas](https://pandas.pydata.org/) Tutorial
**pandas** is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

The **pandas** name itself is derived from *panel data*, an econometrics term for multidimensional structured datasets, and a play on the phrase *Python data analysis* itself.

Cheat Sheets:
* [Official](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [by DataCamp](http://datacamp-community-prod.s3.amazonaws.com/dbed353d-2757-4617-8206-8767ab379ab3)
* [by DataQuest](https://drive.google.com/file/d/1UHK8wtWbADvHKXFC937IS6MTnlSZC_zB/view)

## Load the package

In [1]:
import numpy as np
import pandas as pd

## Main Objects

### Series
[Series](https://pandas.pydata.org/docs/reference/api/pandas.Series.html) - One-dimensional ndarray with axis labels (including time series).

we will use just `s` or `s_`  prefix or `_s` suffix for series.

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(type(s))
s

<class 'pandas.core.series.Series'>

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### DataFrame
we will use just `df` or `df_` prefix or `_df` suffix for dataframes.

#### from Dictionary

In [3]:
names = ["Alex", "Bill", "Charles"]
ages = [15, 28, 36]
 
d = {"name": names, "age": ages}
 
df = pd.DataFrame(d)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

      name  age
0     Alex   15
1     Bill   28
2  Charles   36

#### from Empty DataFrame

In [4]:
df = pd.DataFrame()
df["name"] = names
df["age"] = ages
df

      name  age
0     Alex   15
1     Bill   28
2  Charles   36

## Properties

### Attributes

#### size
`.size`

In [5]:
df.size

6

#### .columns
`.columns`

In [6]:
df.columns

Index(['name', 'age'], dtype='object')

In [7]:
cols = list(df.columns.values)
cols

['name', 'age']

#### .shape
`.shape`

In [8]:
df.shape

(3, 2)

#### .index
`.index`

In [9]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
s

a    3
b   -5
c    7
d    4
dtype: int64

### Viewing data

#### .head() and .tail()
`.head()` - first 5 rows

`.tail()` - last 5 rows

In [12]:
df.head(1)

   name  age
0  Alex   15

In [13]:
df.tail(2)

      name  age
1     Bill   28
2  Charles   36

### Selecting data

#### .loc - by label
`.loc`

In [14]:
df['name']

0       Alex
1       Bill
2    Charles
Name: name, dtype: object

In [15]:
df[['name']]

      name
0     Alex
1     Bill
2  Charles

In [16]:
type(df['name'])

pandas.core.series.Series

In [17]:
type(df[['name']])

pandas.core.frame.DataFrame

In [18]:
# df['nam']

In [19]:
df.loc[:, 'name']

0       Alex
1       Bill
2    Charles
Name: name, dtype: object

In [20]:
df.loc[1, 'name']

'Bill'

In [21]:
df.loc[:,:]

      name  age
0     Alex   15
1     Bill   28
2  Charles   36

#### .iloc - by position
`.iloc`

In [22]:
df.iloc[:, 0]

0       Alex
1       Bill
2    Charles
Name: name, dtype: object

In [23]:
df.iloc[:, 1]

0    15
1    28
2    36
Name: age, dtype: int64

In [24]:
df.iloc[:, :]

      name  age
0     Alex   15
1     Bill   28
2  Charles   36

#### .iterrows()
`.iterrows()`

In [25]:
for index, row in df.iterrows():
    print(index)
    print(row)

0
name    Alex
age       15
Name: 0, dtype: object
1
name    Bill
age       28
Name: 1, dtype: object
2
name    Charles
age          36
Name: 2, dtype: object

#### .describe()
`.describe()`

In [26]:
df.describe()

             age
count   3.000000
mean   26.333333
std    10.598742
min    15.000000
25%    21.500000
50%    28.000000
75%    32.000000
max    36.000000

### Boolean Indexing

In [27]:
df['name']=='Alex'

0     True
1    False
2    False
Name: name, dtype: bool

In [28]:
df['age'] < 30

0     True
1     True
2    False
Name: age, dtype: bool

In [29]:
df[df['age']<30]

   name  age
0  Alex   15
1  Bill   28

In [30]:
df[(df['name']=='Alex') | (df['age']<30)] # or |

   name  age
0  Alex   15
1  Bill   28

In [31]:
df.loc[(df['name']=='Alex') | (df['age']<30)]

   name  age
0  Alex   15
1  Bill   28

In [32]:
df.loc[(df['name']!='Alex')]

      name  age
1     Bill   28
2  Charles   36

In [33]:
# df.loc[(df['name']=='Alex') | (df['age']<30), ['name_length']]

In [34]:
df.loc[df['name']=='Alex', 'age']

0    15
Name: age, dtype: int64

In [35]:
new_df = df[(df['name'] != 'Alex')]
new_df

      name  age
1     Bill   28
2  Charles   36

In [36]:
new_df = new_df.reset_index()
new_df

   index     name  age
0      1     Bill   28
1      2  Charles   36

In [37]:
new_df = df[(df['name']!='Alex')]
new_df

      name  age
1     Bill   28
2  Charles   36

In [38]:
new_df = new_df.reset_index(drop=True)
new_df

      name  age
0     Bill   28
1  Charles   36

In [39]:
new_df = df[(df['name']!='Alex')]
new_df

      name  age
1     Bill   28
2  Charles   36

In [40]:
new_df.reset_index(drop=True, inplace=True)
new_df

      name  age
0     Bill   28
1  Charles   36

### Wrangling

#### calculations

In [41]:
df['new_age'] = df['age'] * 2.5
df

      name  age  new_age
0     Alex   15     37.5
1     Bill   28     70.0
2  Charles   36     90.0

In [42]:
df['Total'] = df['age'] + df['new_age']
df

      name  age  new_age  Total
0     Alex   15     37.5   52.5
1     Bill   28     70.0   98.0
2  Charles   36     90.0  126.0

In [43]:
df.iloc[:,1:3]

   age  new_age
0   15     37.5
1   28     70.0
2   36     90.0

In [44]:
df.iloc[:,1:3].sum(axis=1)

0     52.5
1     98.0
2    126.0
dtype: float64

In [45]:
# sum of columns from 1 to 3
df['Total'] = df.iloc[:,1:3].sum(axis=1)
df

      name  age  new_age  Total
0     Alex   15     37.5   52.5
1     Bill   28     70.0   98.0
2  Charles   36     90.0  126.0

In [46]:
df.loc[:, ['age', 'new_age']].sum(axis=1)

0     52.5
1     98.0
2    126.0
dtype: float64

In [47]:
lst_sum = df.loc[:, ['age', 'new_age']].sum(axis=1).to_list()
lst_sum

[52.5, 98.0, 126.0]

In [48]:
df.loc[:, ['age', 'new_age']].sum(axis=1).head(2)

0    52.5
1    98.0
dtype: float64

In [49]:
df['Total 2'] = df.loc[:, ['age', 'new_age']].mean(axis=1)
df

      name  age  new_age  Total  Total 2
0     Alex   15     37.5   52.5    26.25
1     Bill   28     70.0   98.0    49.00
2  Charles   36     90.0  126.0    63.00

#### changing index

In [50]:
df.set_index('name')

         age  new_age  Total  Total 2
name
Alex      15     37.5   52.5    26.25
Bill      28     70.0   98.0    49.00
Charles   36     90.0  126.0    63.00

#### String Methods
See more at [Working with Text Data](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html)

In [51]:
df['name']

0       Alex
1       Bill
2    Charles
Name: name, dtype: object

In [52]:
df['name'].str.contains('i')

0    False
1     True
2    False
Name: name, dtype: bool

In [53]:
df.loc[df['name'].str.contains('i')]

   name  age  new_age  Total  Total 2
1  Bill   28     70.0   98.0     49.0

In [54]:
df.loc[~df['name'].str.contains('i')]

      name  age  new_age  Total  Total 2
0     Alex   15     37.5   52.5    26.25
2  Charles   36     90.0  126.0    63.00

#### .drop()
`.drop()`

In [55]:
df = df.drop(columns=['new_age', 'Total', 'Total 2'])

In [56]:
df

      name  age
0     Alex   15
1     Bill   28
2  Charles   36

#### .append()
`.append()`

In [57]:
df2 = pd.DataFrame({'name':['David'], 'age':[22]})
df2

    name  age
0  David   22

In [58]:
df = df.append(df2)
df

C:\Users\Lasha_Pertakhia\AppData\Local\Temp\ipykernel_37184\1571675516.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2)

      name  age
0     Alex   15
1     Bill   28
2  Charles   36
0    David   22

#### .concat()
`.concat()`

In [59]:
df = pd.DataFrame(d)
df

      name  age
0     Alex   15
1     Bill   28
2  Charles   36

In [60]:
df = pd.concat([df, df2])
df

      name  age
0     Alex   15
1     Bill   28
2  Charles   36
0    David   22

In [61]:
df.loc[0, :]

    name  age
0   Alex   15
0  David   22

In [62]:
df.iloc[0, :]

name    Alex
age       15
Name: 0, dtype: object

In [63]:
df.iloc[3, :]

name    David
age        22
Name: 0, dtype: object

#### new column

In [64]:
df['interest'] = [np.nan] * df.shape[0]
df.head()

      name  age  interest
0     Alex   15       NaN
1     Bill   28       NaN
2  Charles   36       NaN
0    David   22       NaN

In [65]:
df['interest'] = np.nan
df.head()

      name  age  interest
0     Alex   15       NaN
1     Bill   28       NaN
2  Charles   36       NaN
0    David   22       NaN

#### .insert()
`.insert()`

In [66]:
# df.insert()

#### .rename()
`.rename()`

In [67]:
# df.rename()

#### .sort_values()
`.sort_values()`

In [68]:
df.sort_values('age', ascending=False)

      name  age  interest
2  Charles   36       NaN
1     Bill   28       NaN
0    David   22       NaN
0     Alex   15       NaN

In [69]:
df.sort_values('age', ascending=False).reset_index(drop=True)

      name  age  interest
0  Charles   36       NaN
1     Bill   28       NaN
2    David   22       NaN
3     Alex   15       NaN

In [70]:
df

      name  age  interest
0     Alex   15       NaN
1     Bill   28       NaN
2  Charles   36       NaN
0    David   22       NaN

In [71]:
df['name_length'] = df['name'].str.len()
df

      name  age  interest  name_length
0     Alex   15       NaN            4
1     Bill   28       NaN            4
2  Charles   36       NaN            7
0    David   22       NaN            5

In [72]:
df.iloc[:,0].str.len() + df.iloc[:,1]

0    19
1    32
2    43
0    27
dtype: int64

In [73]:
df[['name_length', 'age']].sum(axis=1)

0    19
1    32
2    43
0    27
dtype: int64

In [74]:
df.iloc[:,[1,3]].sum(axis=1)

0    19
1    32
2    43
0    27
dtype: int64

In [75]:
df[['name_length', 'name', 'age', 'interest']]

   name_length     name  age  interest
0            4     Alex   15       NaN
1            4     Bill   28       NaN
2            7  Charles   36       NaN
0            5    David   22       NaN

##### MLB

In [76]:
# !pip install openpyxl

In [77]:
df_mlb = pd.read_excel('mlb_players.xlsx')
print(df_mlb.columns)
df_mlb = df_mlb.drop(columns='Unnamed: 0')
df_mlb.head()

Index(['Unnamed: 0', 'Name', 'Team', 'Position', 'Height(inches)',
       'Weight(pounds)', 'Age'],
      dtype='object')

              Name Team       Position  Height(inches)  Weight(pounds)    Age
0    Adam_Donachie  BAL        Catcher              74           180.0  22.99
1        Paul_Bako  BAL        Catcher              74           215.0  34.69
2  Ramon_Hernandez  BAL        Catcher              72           210.0  30.78
3     Kevin_Millar  BAL  First_Baseman              72           210.0  35.43
4      Chris_Gomez  BAL  First_Baseman              73           188.0  35.71

In [78]:
df_mlb = df_mlb.rename(columns={'Height(inches)': 'height',
                                'Weight(pounds)': 'weight'})
df_mlb.head()

              Name Team       Position  height  weight    Age
0    Adam_Donachie  BAL        Catcher      74   180.0  22.99
1        Paul_Bako  BAL        Catcher      74   215.0  34.69
2  Ramon_Hernandez  BAL        Catcher      72   210.0  30.78
3     Kevin_Millar  BAL  First_Baseman      72   210.0  35.43
4      Chris_Gomez  BAL  First_Baseman      73   188.0  35.71

In [79]:
df_mlb.columns

Index(['Name', 'Team', 'Position', 'height', 'weight', 'Age'], dtype='object')

In [80]:
df_mlb.columns = ['name', 'team', 'position', 'height', 'weight', 'age']

In [81]:
df_mlb.head()

              name team       position  height  weight    age
0    Adam_Donachie  BAL        Catcher      74   180.0  22.99
1        Paul_Bako  BAL        Catcher      74   215.0  34.69
2  Ramon_Hernandez  BAL        Catcher      72   210.0  30.78
3     Kevin_Millar  BAL  First_Baseman      72   210.0  35.43
4      Chris_Gomez  BAL  First_Baseman      73   188.0  35.71

In [82]:
df_mlb.sort_values('height', ascending=False)

                  name team          position  height  weight    age
928          Jon_Rauch  WAS    Relief_Pitcher      83   260.0  28.42
573      Randy_Johnson  ARZ  Starting_Pitcher      82   231.0  43.47
881        Chris_Young   SD  Starting_Pitcher      82   250.0  27.77
62        Andrew_Sisco  CWS    Relief_Pitcher      81   260.0  24.13
781   Mark_Hendrickson   LA  Starting_Pitcher      81   230.0  32.69
...                ...  ...               ...     ...     ...    ...
86       Chone_Figgins  ANA        Outfielder      68   160.0  29.10
972         Ray_Durham   SF    Second_Baseman      68   196.0  35.25
79      Maicer_Izturis  ANA     Third_Baseman      68   155.0  26.46
1008    David_Eckstein  STL         Shortstop      67   165.0  32.11
1007       Aaron_Miles  STL    Second_Baseman      67   180.0  30.21

[1034 rows x 6 columns]

In [83]:
df_mlb.sort_values(by=['height', 'weight'])

                  name team          position  height  weight    age
1008    David_Eckstein  STL         Shortstop      67   165.0  32.11
1007       Aaron_Miles  STL    Second_Baseman      67   180.0  30.21
827       Fabio_Castro  PHI    Relief_Pitcher      68   150.0  22.11
79      Maicer_Izturis  ANA     Third_Baseman      68   155.0  26.46
86       Chone_Figgins  ANA        Outfielder      68   160.0  29.10
...                ...  ...               ...     ...     ...    ...
781   Mark_Hendrickson   LA  Starting_Pitcher      81   230.0  32.69
62        Andrew_Sisco  CWS    Relief_Pitcher      81   260.0  24.13
573      Randy_Johnson  ARZ  Starting_Pitcher      82   231.0  43.47
881        Chris_Young   SD  Starting_Pitcher      82   250.0  27.77
928          Jon_Rauch  WAS    Relief_Pitcher      83   260.0  28.42

[1034 rows x 6 columns]

In [84]:
df_mlb.sort_values(by=['height', 'weight'], ascending=[False, True])

                  name team          position  height  weight    age
928          Jon_Rauch  WAS    Relief_Pitcher      83   260.0  28.42
573      Randy_Johnson  ARZ  Starting_Pitcher      82   231.0  43.47
881        Chris_Young   SD  Starting_Pitcher      82   250.0  27.77
781   Mark_Hendrickson   LA  Starting_Pitcher      81   230.0  32.69
62        Andrew_Sisco  CWS    Relief_Pitcher      81   260.0  24.13
...                ...  ...               ...     ...     ...    ...
867       Marcus_Giles   SD    Second_Baseman      68   180.0  28.79
972         Ray_Durham   SF    Second_Baseman      68   196.0  35.25
773       Delwyn_Young   LA        Outfielder      68   209.0  24.67
1008    David_Eckstein  STL         Shortstop      67   165.0  32.11
1007       Aaron_Miles  STL    Second_Baseman      67   180.0  30.21

[1034 rows x 6 columns]

In [85]:
df_mlb.loc[df_mlb['team']=='LA']

                  name team          position  height  weight    age
760    Mike_Lieberthal   LA           Catcher      72   190.0  35.12
761     Russell_Martin   LA           Catcher      71   202.0  24.04
762       Olmedo_Saenz   LA     First_Baseman      71   221.0  36.39
763        James_Loney   LA     First_Baseman      75   200.0  22.81
764  Nomar_Garciaparra   LA     First_Baseman      72   190.0  33.60
765          Jeff_Kent   LA    Second_Baseman      73   210.0  38.98
766     Ramon_Martinez   LA    Second_Baseman      73   190.0  34.39
767    Marlon_Anderson   LA    Second_Baseman      71   200.0  33.15
768      Rafael_Furcal   LA         Shortstop      70   165.0  29.35
769     Wilson_Betemit   LA     Third_Baseman      75   190.0  26.59
770       Andy_LaRoche   LA     Third_Baseman      71   185.0  23.46
771          Matt_Kemp   LA        Outfielder      76   230.0  22.43
772       Andre_Ethier   LA        Outfielder      73   208.0  24.89
773       Delwyn_Young   LA        Outfielder      68   209.0  24.67
774        Jason_Repko   LA        Outfielder      71   175.0  26.17
775        Juan_Pierre   LA        Outfielder      72   180.0  29.54
776      Luis_Gonzalez   LA        Outfielder      74   200.0  39.49
777      Jason_Schmidt   LA  Starting_Pitcher      77   205.0  34.08
778         Randy_Wolf   LA  Starting_Pitcher      72   200.0  30.52
779         Brad_Penny   LA  Starting_Pitcher      76   250.0  28.77
780         Derek_Lowe   LA  Starting_Pitcher      78   210.0  33.75
781   Mark_Hendrickson   LA  Starting_Pitcher      81   230.0  32.69
782   Chad_Billingsley   LA  Starting_Pitcher      72   244.0  22.59
783      Takashi_Saito   LA    Relief_Pitcher      73   202.0  37.04
784   Jonathan_Broxton   LA    Relief_Pitcher      76   240.0  22.70
785      Hong-Chih_Kuo   LA    Relief_Pitcher      72   200.0  25.60
786        Eric_Stults   LA    Relief_Pitcher      72   215.0  27.23
787      Chin-Hui_Tsao   LA    Relief_Pitcher      74   177.0  25.74
788       Tim_Hamulack   LA    Relief_Pitcher      76   210.0  30.29
789    Yhency_Brazoban   LA    Relief_Pitcher      73   170.0  26.72
790        Brett_Tomko   LA    Relief_Pitcher      76   215.0  33.90
791         Joe_Beimel   LA    Relief_Pitcher      75   217.0  29.86
792      Elmer_Dessens   LA    Relief_Pitcher      70   198.0  36.13

In [86]:
df_mlb.loc[(df_mlb['team']=='LA') | (df_mlb['team']=='SF')]

                   name team        position  height  weight    age
760     Mike_Lieberthal   LA         Catcher      72   190.0  35.12
761      Russell_Martin   LA         Catcher      71   202.0  24.04
762        Olmedo_Saenz   LA   First_Baseman      71   221.0  36.39
763         James_Loney   LA   First_Baseman      75   200.0  22.81
764   Nomar_Garciaparra   LA   First_Baseman      72   190.0  33.60
...                 ...  ...             ...     ...     ...    ...
997        Brian_Wilson   SF  Relief_Pitcher      73   205.0  24.96
998       Merkin_Valdez   SF  Relief_Pitcher      77   208.0  25.30
999      Brad_Hennessey   SF  Relief_Pitcher      74   185.0  27.06
1000       Billy_Sadler   SF  Relief_Pitcher      72   190.0  25.44
1001          Pat_Misch   SF  Relief_Pitcher      74   170.0  25.53

[67 rows x 6 columns]

In [87]:
team_filter = df_mlb['team'].isin(['LA', 'SF'])
print(team_filter)

df_mlb[team_filter]

0       False
1       False
2       False
3       False
4       False
        ...
1029    False
1030    False
1031    False
1032    False
1033    False
Name: team, Length: 1034, dtype: bool

                   name team        position  height  weight    age
760     Mike_Lieberthal   LA         Catcher      72   190.0  35.12
761      Russell_Martin   LA         Catcher      71   202.0  24.04
762        Olmedo_Saenz   LA   First_Baseman      71   221.0  36.39
763         James_Loney   LA   First_Baseman      75   200.0  22.81
764   Nomar_Garciaparra   LA   First_Baseman      72   190.0  33.60
...                 ...  ...             ...     ...     ...    ...
997        Brian_Wilson   SF  Relief_Pitcher      73   205.0  24.96
998       Merkin_Valdez   SF  Relief_Pitcher      77   208.0  25.30
999      Brad_Hennessey   SF  Relief_Pitcher      74   185.0  27.06
1000       Billy_Sadler   SF  Relief_Pitcher      72   190.0  25.44
1001          Pat_Misch   SF  Relief_Pitcher      74   170.0  25.53

[67 rows x 6 columns]

In [88]:
team_filter = df_mlb[['position', 'team']].isin({'position':['Catcher', 'Relief_Pitcher'], 'team': ['LA', 'SF']})
print(team_filter)
df_mlb[team_filter]

      position   team
0         True  False
1         True  False
2         True  False
3        False  False
4        False  False
...        ...    ...
1029      True  False
1030      True  False
1031      True  False
1032      True  False
1033      True  False

[1034 rows x 2 columns]

     name team        position  height  weight  age
0     NaN  NaN         Catcher     NaN     NaN  NaN
1     NaN  NaN         Catcher     NaN     NaN  NaN
2     NaN  NaN         Catcher     NaN     NaN  NaN
3     NaN  NaN             NaN     NaN     NaN  NaN
4     NaN  NaN             NaN     NaN     NaN  NaN
...   ...  ...             ...     ...     ...  ...
1029  NaN  NaN  Relief_Pitcher     NaN     NaN  NaN
1030  NaN  NaN  Relief_Pitcher     NaN     NaN  NaN
1031  NaN  NaN  Relief_Pitcher     NaN     NaN  NaN
1032  NaN  NaN  Relief_Pitcher     NaN     NaN  NaN
1033  NaN  NaN  Relief_Pitcher     NaN     NaN  NaN

[1034 rows x 6 columns]

In [89]:
team_filter = df_mlb['team'].isin(['LA', 'SF'])
position_filter = df_mlb['position'].isin(['Catcher', 'Relief_Pitcher'])
my_filter = (team_filter & position_filter)
# print(my_filter)
df_mlb[my_filter]

                  name team        position  height  weight    age
760    Mike_Lieberthal   LA         Catcher      72   190.0  35.12
761     Russell_Martin   LA         Catcher      71   202.0  24.04
783      Takashi_Saito   LA  Relief_Pitcher      73   202.0  37.04
784   Jonathan_Broxton   LA  Relief_Pitcher      76   240.0  22.70
785      Hong-Chih_Kuo   LA  Relief_Pitcher      72   200.0  25.60
786        Eric_Stults   LA  Relief_Pitcher      72   215.0  27.23
787      Chin-Hui_Tsao   LA  Relief_Pitcher      74   177.0  25.74
788       Tim_Hamulack   LA  Relief_Pitcher      76   210.0  30.29
789    Yhency_Brazoban   LA  Relief_Pitcher      73   170.0  26.72
790        Brett_Tomko   LA  Relief_Pitcher      76   215.0  33.90
791         Joe_Beimel   LA  Relief_Pitcher      75   217.0  29.86
792      Elmer_Dessens   LA  Relief_Pitcher      70   198.0  36.13
968      Bengie_Molina   SF         Catcher      71   220.0  32.61
969    Eliezer_Alfonzo   SF         Catcher      72   223.0  28.06
991       Vinnie_Chulk   SF  Relief_Pitcher      74   195.0  28.20
992      Kevin_Correia   SF  Relief_Pitcher      75   200.0  26.52
993        Steve_Kline   SF  Relief_Pitcher      73   215.0  34.52
994    Armando_Benitez   SF  Relief_Pitcher      76   229.0  34.32
995       Scott_Munter   SF  Relief_Pitcher      78   240.0  26.98
996      Jack_Taschner   SF  Relief_Pitcher      75   207.0  28.86
997       Brian_Wilson   SF  Relief_Pitcher      73   205.0  24.96
998      Merkin_Valdez   SF  Relief_Pitcher      77   208.0  25.30
999     Brad_Hennessey   SF  Relief_Pitcher      74   185.0  27.06
1000      Billy_Sadler   SF  Relief_Pitcher      72   190.0  25.44
1001         Pat_Misch   SF  Relief_Pitcher      74   170.0  25.53

##### Drinks

In [90]:
df_drinks = pd.read_excel('drinks.xlsx')
df_drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [91]:
df_drinks.sort_values(by='beer_servings', ascending=True)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
40,Cook Islands,0,254,74,5.9
79,Iran,0,0,0,0.0
90,Kuwait,0,0,0,0.0
97,Libya,0,0,0,0.0
...,...,...,...,...,...
135,Poland,343,215,56,10.9
65,Germany,346,117,175,11.3
62,Gabon,347,98,59,8.9
45,Czech Republic,361,170,134,11.8
117,Namibia,376,3,1,6.8

In [92]:
df_drinks.sort_values(by=['beer_servings', 'spirit_servings'],
                      ascending=[False, False])

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
117,Namibia,376,3,1,6.8
45,Czech Republic,361,170,134,11.8
62,Gabon,347,98,59,8.9
65,Germany,346,117,175,11.3
98,Lithuania,343,244,56,12.9
...,...,...,...,...,...
107,Mauritania,0,0,0,0.0
111,Monaco,0,0,0,0.0
128,Pakistan,0,0,0,0.0
147,San Marino,0,0,0,0.0
158,Somalia,0,0,0,0.0

### Filtering

#### .reset_index()
`.reset_index()`

In [93]:
df_new = df.loc[(df['name']=='Alex') | (df['age']<30)]
df_new = df_new.reset_index()
df_new

   index   name  age  interest  name_length
0      0   Alex   15       NaN            4
1      1   Bill   28       NaN            4
2      0  David   22       NaN            5

In [94]:
df_new = df.loc[(df['name']=='Alex') | (df['age']<30)]
df_new.reset_index(inplace=True)
df_new

   index   name  age  interest  name_length
0      0   Alex   15       NaN            4
1      1   Bill   28       NaN            4
2      0  David   22       NaN            5

In [95]:
df.loc[~df['name'].str.contains('l')]

    name  age  interest  name_length
0  David   22       NaN            5

### Conditional Changes

In [96]:
df

      name  age  interest  name_length
0     Alex   15       NaN            4
1     Bill   28       NaN            4
2  Charles   36       NaN            7
0    David   22       NaN            5

In [97]:
df['age'] < 25

0     True
1    False
2    False
0     True
Name: age, dtype: bool

In [98]:
df.loc[df['age'] < 25, 'age'] = 25
df

      name  age  interest  name_length
0     Alex   25       NaN            4
1     Bill   28       NaN            4
2  Charles   36       NaN            7
0    David   25       NaN            5

### Aggregation
!needs more detailed examples

#### .groupby()
`.groupby()`

In [99]:
df.groupby('name')

In [100]:
df.groupby('name').mean()

          age  interest  name_length
name
Alex     25.0       NaN          4.0
Bill     28.0       NaN          4.0
Charles  36.0       NaN          7.0
David    25.0       NaN          5.0

In [101]:
#     size ( ) ## like count()
#     sum ( )
#     first ( )
#     last ( )
    
#         mean ( )
#     std ( ) ## Standard Deviation
#     var ( ) ## Variance
#     min ( )
#     max ( )

In [102]:
df_mlb.dtypes

name         object
team         object
position     object
height        int64
weight      float64
age         float64
dtype: object

In [103]:
df_mlb.groupby('team')

In [104]:
df_mlb.groupby('team').mean()

         height      weight        age
team
ANA   73.342857  201.085714  28.808857
ARZ   73.678571  208.071429  27.835000
ATL   73.837838  199.513514  28.325676
BAL   73.485714  196.342857  29.062286
BOS   74.222222  204.833333  29.783889
CHC   74.138889  204.138889  28.419167
CIN   73.666667  203.942857  29.853056
CLE   74.085714  201.657143  28.360286
COL   73.942857  198.371429  28.056000
CWS   74.636364  210.515152  28.270909
DET   73.702703  203.837838  29.149459
FLA   73.937500  202.375000  25.816250
HOU   72.970588  198.058824  29.911471
KC    73.514286  195.914286  28.824857
LA    73.363636  203.878788  29.778182
MIN   73.090909  201.181818  28.241818
MLW   73.600000  205.285714  29.040571
NYM   72.947368  197.210526  30.525000
NYY   74.343750  208.312500  30.149687
OAK   73.270270  198.972973  28.716486
PHI   73.555556  195.194444  29.242222
PIT   73.600000  204.371429  27.194857
SD    73.484848  203.757576  29.713030
SEA   73.588235  198.676471  27.516471
SF    73.558824  202.794118  29.929706
STL   73.625000  201.625000  30.477500
TB    73.696970  197.454545  26.797273
TEX   74.085714  202.600000  28.317714
TOR   73.882353  203.852941  28.697059
WAS   74.138889  199.750000  26.939444

In [105]:
df_mlb[['height', 'weight', 'team']].groupby('team').mean()

         height      weight
team
ANA   73.342857  201.085714
ARZ   73.678571  208.071429
ATL   73.837838  199.513514
BAL   73.485714  196.342857
BOS   74.222222  204.833333
CHC   74.138889  204.138889
CIN   73.666667  203.942857
CLE   74.085714  201.657143
COL   73.942857  198.371429
CWS   74.636364  210.515152
DET   73.702703  203.837838
FLA   73.937500  202.375000
HOU   72.970588  198.058824
KC    73.514286  195.914286
LA    73.363636  203.878788
MIN   73.090909  201.181818
MLW   73.600000  205.285714
NYM   72.947368  197.210526
NYY   74.343750  208.312500
OAK   73.270270  198.972973
PHI   73.555556  195.194444
PIT   73.600000  204.371429
SD    73.484848  203.757576
SEA   73.588235  198.676471
SF    73.558824  202.794118
STL   73.625000  201.625000
TB    73.696970  197.454545
TEX   74.085714  202.600000
TOR   73.882353  203.852941
WAS   74.138889  199.750000

In [106]:
df_mlb.groupby('team')['height', 'weight'].mean()

C:\Users\Lasha_Pertakhia\AppData\Local\Temp\ipykernel_37184\134419245.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df_mlb.groupby('team')['height', 'weight'].mean()

         height      weight
team
ANA   73.342857  201.085714
ARZ   73.678571  208.071429
ATL   73.837838  199.513514
BAL   73.485714  196.342857
BOS   74.222222  204.833333
CHC   74.138889  204.138889
CIN   73.666667  203.942857
CLE   74.085714  201.657143
COL   73.942857  198.371429
CWS   74.636364  210.515152
DET   73.702703  203.837838
FLA   73.937500  202.375000
HOU   72.970588  198.058824
KC    73.514286  195.914286
LA    73.363636  203.878788
MIN   73.090909  201.181818
MLW   73.600000  205.285714
NYM   72.947368  197.210526
NYY   74.343750  208.312500
OAK   73.270270  198.972973
PHI   73.555556  195.194444
PIT   73.600000  204.371429
SD    73.484848  203.757576
SEA   73.588235  198.676471
SF    73.558824  202.794118
STL   73.625000  201.625000
TB    73.696970  197.454545
TEX   74.085714  202.600000
TOR   73.882353  203.852941
WAS   74.138889  199.750000

In [107]:
df_mlb_grouped = df_mlb.groupby('team')

In [108]:
df_mlb_grouped.mean()

         height      weight        age
team
ANA   73.342857  201.085714  28.808857
ARZ   73.678571  208.071429  27.835000
ATL   73.837838  199.513514  28.325676
BAL   73.485714  196.342857  29.062286
BOS   74.222222  204.833333  29.783889
CHC   74.138889  204.138889  28.419167
CIN   73.666667  203.942857  29.853056
CLE   74.085714  201.657143  28.360286
COL   73.942857  198.371429  28.056000
CWS   74.636364  210.515152  28.270909
DET   73.702703  203.837838  29.149459
FLA   73.937500  202.375000  25.816250
HOU   72.970588  198.058824  29.911471
KC    73.514286  195.914286  28.824857
LA    73.363636  203.878788  29.778182
MIN   73.090909  201.181818  28.241818
MLW   73.600000  205.285714  29.040571
NYM   72.947368  197.210526  30.525000
NYY   74.343750  208.312500  30.149687
OAK   73.270270  198.972973  28.716486
PHI   73.555556  195.194444  29.242222
PIT   73.600000  204.371429  27.194857
SD    73.484848  203.757576  29.713030
SEA   73.588235  198.676471  27.516471
SF    73.558824  202.794118  29.929706
STL   73.625000  201.625000  30.477500
TB    73.696970  197.454545  26.797273
TEX   74.085714  202.600000  28.317714
TOR   73.882353  203.852941  28.697059
WAS   74.138889  199.750000  26.939444

In [109]:
df_mlb_grouped.sum()

      height  weight      age
team
ANA     2567  7038.0  1008.31
ARZ     2063  5826.0   779.38
ATL     2732  7382.0  1048.05
BAL     2572  6872.0  1017.18
BOS     2672  7374.0  1072.22
CHC     2669  7349.0  1023.09
CIN     2652  7138.0  1074.71
CLE     2593  7058.0   992.61
COL     2588  6943.0   981.96
CWS     2463  6947.0   932.94
DET     2727  7542.0  1078.53
FLA     2366  6476.0   826.12
HOU     2481  6734.0  1016.99
KC      2573  6857.0  1008.87
LA      2421  6728.0   982.68
MIN     2412  6639.0   931.98
MLW     2576  7185.0  1016.42
NYM     2772  7494.0  1159.95
NYY     2379  6666.0   964.79
OAK     2711  7362.0  1062.51
PHI     2648  7027.0  1052.72
PIT     2576  7153.0   951.82
SD      2425  6724.0   980.53
SEA     2502  6755.0   935.56
SF      2501  6895.0  1017.61
STL     2356  6452.0   975.28
TB      2432  6516.0   884.31
TEX     2593  7091.0   991.12
TOR     2512  6931.0   975.70
WAS     2669  7191.0   969.82

In [110]:
for team, grouped_data in df_mlb_grouped:
    print(team, '\n', type(grouped_data))

ANA
 <class 'pandas.core.frame.DataFrame'>
ARZ
 <class 'pandas.core.frame.DataFrame'>
ATL
 <class 'pandas.core.frame.DataFrame'>
BAL
 <class 'pandas.core.frame.DataFrame'>
BOS
 <class 'pandas.core.frame.DataFrame'>
CHC
 <class 'pandas.core.frame.DataFrame'>
CIN
 <class 'pandas.core.frame.DataFrame'>
CLE
 <class 'pandas.core.frame.DataFrame'>
COL
 <class 'pandas.core.frame.DataFrame'>
CWS
 <class 'pandas.core.frame.DataFrame'>
DET
 <class 'pandas.core.frame.DataFrame'>
FLA
 <class 'pandas.core.frame.DataFrame'>
HOU
 <class 'pandas.core.frame.DataFrame'>
KC
 <class 'pandas.core.frame.DataFrame'>
LA
 <class 'pandas.core.frame.DataFrame'>
MIN
 <class 'pandas.core.frame.DataFrame'>
MLW
 <class 'pandas.core.frame.DataFrame'>
NYM
 <class 'pandas.core.frame.DataFrame'>
NYY
 <class 'pandas.core.frame.DataFrame'>
OAK
 <class 'pandas.core.frame.DataFrame'>
PHI
 <class 'pandas.core.frame.DataFrame'>
PIT
 <class 'pandas.core.frame.DataFrame'>
SD
 <class 'pandas.core.frame.DataFrame'>
SEA
 <class 'pandas.core.frame.DataFrame'>
SF
 <class 'pandas.core.frame.DataFrame'>
STL
 <class 'pandas.core.frame.DataFrame'>
TB
 <class 'pandas.core.frame.DataFrame'>
TEX
 <class 'pandas.core.frame.DataFrame'>
TOR
 <class 'pandas.core.frame.DataFrame'>
WAS
 <class 'pandas.core.frame.DataFrame'>

#### Pivot
[`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html)

[visual explanation](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html#reshaping-by-pivoting-dataframe-objects)

In [111]:
np.random.seed(42)
for_pivot_df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})

In [112]:
for_pivot_df

        A  B    C         D         E
0     one  A  foo  0.496714  0.241962
1     one  B  foo -0.138264 -1.913280
2     two  C  foo  0.647689 -1.724918
3   three  A  bar  1.523030 -0.562288
4     one  B  bar -0.234153 -1.012831
5     one  C  bar -0.234137  0.314247
6     two  A  foo  1.579213 -0.908024
7   three  B  foo  0.767435 -1.412304
8     one  C  foo -0.469474  1.465649
9     one  A  bar  0.542560 -0.225776
10    two  B  bar -0.463418  0.067528
11  three  C  bar -0.465730 -1.424748

In [113]:
pd.pivot_table(for_pivot_df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.542560  0.496714
      B -0.234153 -0.138264
      C -0.234137 -0.469474
three A  1.523030       NaN
      B       NaN  0.767435
      C -0.465730       NaN
two   A       NaN  1.579213
      B -0.463418       NaN
      C       NaN  0.647689

#### Stack

In [114]:
np.random.seed(42)
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                        'one', 'two', 'one', 'two']]))

index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
for_stack_df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [115]:
for_stack_df

                     A         B
first second
bar   one     0.496714 -0.138264
      two     0.647689  1.523030
baz   one    -0.234153 -0.234137
      two     1.579213  0.767435
foo   one    -0.469474  0.542560
      two    -0.463418 -0.465730
qux   one     0.241962 -1.913280
      two    -1.724918 -0.562288

In [116]:
stacked = for_stack_df.stack()

In [117]:
stacked.unstack()

                     A         B
first second
bar   one     0.496714 -0.138264
      two     0.647689  1.523030
baz   one    -0.234153 -0.234137
      two     1.579213  0.767435
foo   one    -0.469474  0.542560
      two    -0.463418 -0.465730
qux   one     0.241962 -1.913280
      two    -1.724918 -0.562288

In [118]:
stacked.unstack(1)

second        one       two
first
bar   A  0.496714  0.647689
      B -0.138264  1.523030
baz   A -0.234153  1.579213
      B -0.234137  0.767435
foo   A -0.469474 -0.463418
      B  0.542560 -0.465730
qux   A  0.241962 -1.724918
      B -1.913280 -0.562288

In [119]:
stacked.unstack(0)

first          bar       baz       foo       qux
second
one    A  0.496714 -0.234153 -0.469474  0.241962
       B -0.138264 -0.234137  0.542560 -1.913280
two    A  0.647689  1.579213 -0.463418 -1.724918
       B  1.523030  0.767435 -0.465730 -0.562288

### Working with Large Amounts of Data
!needs more detailed examples

In [120]:
df_agg = pd.DataFrame()

# for df in pd.read_csv('filename.csv', chunksize=10):
#     print(df)
#     results = df.gorupby(['some column']).count()
#     df_agg = pd.concat([df_agg, results])

df_agg.head()

Empty DataFrame
Columns: []
Index: []